app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"   ORDER BY created_at ASC
---
  def index
    @categories = Category.all.order("created_at ASC")

INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-03-10 00:38:55.988605"], ["title", "Sandwiches"], ["updated_at", "2015-03-10 00:38:55.988605"]]
---
  def create
    @category = Category.new(category_params)
    if @category.save